// 实现 pow(x, n) ，即计算 x 的 n 次幂函数（即，xn）。

//  

// 示例 1：

// 输入：x = 2.00000, n = 10
// 输出：1024.00000
// 示例 2：

// 输入：x = 2.10000, n = 3
// 输出：9.26100
// 示例 3：

// 输入：x = 2.00000, n = -2
// 输出：0.25000
// 解释：2-2 = 1/22 = 1/4 = 0.25
//  

// 提示：

// -100.0 < x < 100.0
// -231 <= n <= 231-1
// -104 <= xn <= 104

import myPow from './0050_my_pow';

test('myPow:1', () => {
    expect(myPow(2.00000, 10)).toBeCloseTo(2.00000 ** 10);
});

test('twoSum:2', () => {
    expect(myPow(2.1, 3)).toBeCloseTo(2.1 ** 3);
});

test('twoSum:3', () => {
    expect(myPow(2.00000, -2)).toBeCloseTo(2.0000 ** -2);
});

test('twoSum:4', () => {
    expect(myPow(0.00001, 2147483647)).toBeCloseTo(0.0001 ** 2147483647);
});
